# Azure Pentesting

{% hint style="success" %}
AWS рд╣реИрдХрд┐рдВрдЧ рд╕реАрдЦреЗрдВ рдФрд░ рдЕрднреНрдпрд╛рд╕ рдХрд░реЗрдВ:<img src="../../.gitbook/assets/image (1) (1) (1) (1).png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="../../.gitbook/assets/image (1) (1) (1) (1).png" alt="" data-size="line">\
GCP рд╣реИрдХрд┐рдВрдЧ рд╕реАрдЦреЗрдВ рдФрд░ рдЕрднреНрдпрд╛рд╕ рдХрд░реЗрдВ: <img src="../../.gitbook/assets/image (2) (1).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="../../.gitbook/assets/image (2) (1).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>HackTricks рдХрд╛ рд╕рдорд░реНрдерди рдХрд░реЗрдВ</summary>

* [**рд╕рджрд╕реНрдпрддрд╛ рдпреЛрдЬрдирд╛рдПрдБ**](https://github.com/sponsors/carlospolop) рджреЗрдЦреЗрдВ!
* **рд╣рдорд╛рд░реЗ** ЁЯТм [**Discord рд╕рдореВрд╣**](https://discord.gg/hRep4RUj7f) рдпрд╛ [**рдЯреЗрд▓реАрдЧреНрд░рд╛рдо рд╕рдореВрд╣**](https://t.me/peass) рдореЗрдВ рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ рдпрд╛ **рд╣рдорд╛рд░рд╛ рдЕрдиреБрд╕рд░рдг рдХрд░реЗрдВ** **Twitter** ЁЯРж [**@hacktricks\_live**](https://twitter.com/hacktricks_live)**.**
* **рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ** [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) рдЧрд┐рдЯрд╣рдм рд░рд┐рдкреЛрдЬрд┐рдЯрд░реА рдореЗрдВ PR рд╕рдмрдорд┐рдЯ рдХрд░рдХреЗред

</details>
{% endhint %}

## рдореВрд▓ рдЬрд╛рдирдХрд╛рд░реА

{% content-ref url="az-basic-information/" %}
[az-basic-information](az-basic-information/)
{% endcontent-ref %}

## Azure Pentester/Red Team рдХрд╛рд░реНрдпрдкреНрд░рдгрд╛рд▓реА

AZURE рд╡рд╛рддрд╛рд╡рд░рдг рдХрд╛ рдСрдбрд┐рдЯ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдпрд╣ рдЬрд╛рдирдирд╛ рдмрд╣реБрдд рдорд╣рддреНрд╡рдкреВрд░реНрдг рд╣реИ: рдХреМрди рд╕реА **рд╕реЗрд╡рд╛рдПрдБ рдЙрдкрдпреЛрдЧ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВ**, рдХреНрдпрд╛ **рдкреНрд░рджрд░реНрд╢рд┐рдд рдХрд┐рдпрд╛ рдЬрд╛ рд░рд╣рд╛ рд╣реИ**, рдХрд┐рд╕рдХреЗ рдкрд╛рд╕ **рдкрд╣реБрдБрдЪ** рд╣реИ, рдФрд░ рдЖрдВрддрд░рд┐рдХ Azure рд╕реЗрд╡рд╛рдПрдБ рдФрд░ **рдмрд╛рд╣рд░реА рд╕реЗрд╡рд╛рдПрдБ** рдХреИрд╕реЗ рдЬреБрдбрд╝реА рд╣реБрдИ рд╣реИрдВред

Red Team рдХреЗ рджреГрд╖реНрдЯрд┐рдХреЛрдг рд╕реЗ, **Azure рд╡рд╛рддрд╛рд╡рд░рдг рдХреЛ рд╕рдордЭреМрддрд╛ рдХрд░рдиреЗ рдХрд╛ рдкрд╣рд▓рд╛ рдХрджрдо** Azure AD рдХреЗ рд▓рд┐рдП рдХреБрдЫ **рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕** рдкреНрд░рд╛рдкреНрдд рдХрд░рдирд╛ рд╣реИред рдпрд╣рд╛рдБ рдХреБрдЫ рд╡рд┐рдЪрд╛рд░ рджрд┐рдП рдЧрдП рд╣реИрдВ рдХрд┐ рдЖрдк рдРрд╕рд╛ рдХреИрд╕реЗ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ:

* github (рдпрд╛ рд╕рдорд╛рди) рдореЗрдВ **рд▓реАрдХ** - OSINT
* **рд╕реЛрд╢рд▓** рдЗрдВрдЬреАрдирд┐рдпрд░рд┐рдВрдЧ
* **рдкрд╛рд╕рд╡рд░реНрдб** рдкреБрди: рдЙрдкрдпреЛрдЧ (рдкрд╛рд╕рд╡рд░реНрдб рд▓реАрдХ)
* Azure-Hosted рдЕрдиреБрдкреНрд░рдпреЛрдЧреЛрдВ рдореЗрдВ рдХрдордЬреЛрд░рд┐рдпрд╛рдБ
* [**рд╕рд░реНрд╡рд░ рд╕рд╛рдЗрдб рдЕрдиреБрд░реЛрдз рдзреЛрдЦрд╛рдзрдбрд╝реА**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) рдЬрд┐рд╕рдореЗрдВ рдореЗрдЯрд╛рдбреЗрдЯрд╛ рдПрдВрдбрдкреЙрдЗрдВрдЯ рддрдХ рдкрд╣реБрдБрдЪ рд╣реИ
* **рд╕реНрдерд╛рдиреАрдп рдлрд╝рд╛рдЗрд▓ рдкрдврд╝реЗрдВ**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* рдлрд╝рд╛рдЗрд▓ **`accessTokens.json`** `az cli` рдореЗрдВ 2.30 рд╕реЗ рдкрд╣рд▓реЗ - Jan2022 - **рд╕рд╛рдлрд╝ рдкрд╛рда** рдореЗрдВ **рдПрдХреНрд╕реЗрд╕ рдЯреЛрдХрди** рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рддреА рд╣реИ
* рдлрд╝рд╛рдЗрд▓ **`azureProfile.json`** рдореЗрдВ рд▓реЙрдЧ рдЗрди рдХрд┐рдП рдЧрдП рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ **рдЬрд╛рдирдХрд╛рд░реА** рд╣реЛрддреА рд╣реИред
* **`az logout`** рдЯреЛрдХрди рдХреЛ рд╣рдЯрд╛ рджреЗрддрд╛ рд╣реИред
* **`Az PowerShell`** рдХреЗ рдкреБрд░рд╛рдиреЗ рд╕рдВрд╕реНрдХрд░рдгреЛрдВ рдиреЗ **рд╕рд╛рдлрд╝** рдкрд╛рда рдореЗрдВ **`TokenCache.dat`** рдореЗрдВ **рдПрдХреНрд╕реЗрд╕ рдЯреЛрдХрди** рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд┐рдПред рдпрд╣ **`AzureRmContext.json`** рдореЗрдВ **рд╕рд╛рдлрд╝** рдкрд╛рда рдореЗрдВ **ServicePrincipalSecret** рднреА рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рддрд╛ рд╣реИред **`Save-AzContext`** cmdlet рдХрд╛ рдЙрдкрдпреЛрдЧ **рдЯреЛрдХрди** рдХреЛ **рд╕рдВрдЧреНрд░рд╣реАрдд** рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред\
рдЙрдиреНрд╣реЗрдВ рд╣рдЯрд╛рдиреЗ рдХреЗ рд▓рд┐рдП `Disconnect-AzAccount` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВред
* 3rd рдкрдХреНрд╖ **рднрдВрдЧ** рд╣реБрдП
* **рдЖрдВрддрд░рд┐рдХ** рдХрд░реНрдордЪрд╛рд░реА
* [**рд╕рд╛рдорд╛рдиреНрдп рдлрд╝рд┐рд╢рд┐рдВрдЧ**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдпрд╛ Oauth рдРрдк)
* [рдбрд┐рд╡рд╛рдЗрд╕ рдХреЛрдб рдкреНрд░рдорд╛рдгреАрдХрд░рдг рдлрд╝рд┐рд╢рд┐рдВрдЧ](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **рдкрд╛рд╕рд╡рд░реНрдб рд╕реНрдкреНрд░реЗрдЗрдВрдЧ**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

рдпрд╣рд╛рдБ рддрдХ рдХрд┐ рдЕрдЧрд░ рдЖрдкрдиреЗ Azure рдЯреЗрдиреЗрдЯ рдХреЗ рдЕрдВрджрд░ рдХрд┐рд╕реА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЛ **рд╕рдордЭреМрддрд╛ рдирд╣реАрдВ рдХрд┐рдпрд╛** рд╣реИ, рддреЛ рдЖрдк рдЗрд╕рд╕реЗ **рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА** рдПрдХрддреНрд░ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
рдПрдХ рдмрд╛рд░ рдЬрдм рдЖрдк рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдкреНрд░рд╛рдкреНрдд рдХрд░рдиреЗ рдореЗрдВ рд╕рдлрд▓ рд╣реЛ рдЬрд╛рддреЗ рд╣реИрдВ, рддреЛ рдЖрдкрдХреЛ рдпрд╣ рдЬрд╛рдирдиреЗ рдХреА рдЖрд╡рд╢реНрдпрдХрддрд╛ рд╣реИ рдХрд┐ **рдпреЗ рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдХрд┐рд╕рдХреЗ рд╣реИрдВ**, рдФрд░ **рдЗрдирдХреЗ рдкрд╛рд╕ рдХреНрдпрд╛ рдкрд╣реБрдБрдЪ рд╣реИ**, рдЗрд╕рд▓рд┐рдП рдЖрдкрдХреЛ рдХреБрдЫ рдмреБрдирд┐рдпрд╛рджреА рдЧрдгрдирд╛ рдХрд░рдиреА рд╣реЛрдЧреА:
{% endhint %}

## рдмреБрдирд┐рдпрд╛рджреА рдЧрдгрдирд╛

{% hint style="info" %}
рдпрд╛рдж рд░рдЦреЗрдВ рдХрд┐ рдЧрдгрдирд╛ рдХрд╛ **рд╕рдмрд╕реЗ рд╢реЛрд░рдЧреБрд▓** рд╡рд╛рд▓рд╛ рднрд╛рдЧ **рд▓реЙрдЧрд┐рди** рд╣реИ, рди рдХрд┐ рд╕реНрд╡рдпрдВ рдЧрдгрдирд╛ред
{% endhint %}

### SSRF

рдпрджрд┐ рдЖрдкрдиреЗ Azure рдХреЗ рдЕрдВрджрд░ рдПрдХ рдорд╢реАрди рдореЗрдВ SSRF рдкрд╛рдпрд╛ рд╣реИ рддреЛ рдЗрд╕ рдкреГрд╖реНрда рдкрд░ рдЯреНрд░рд┐рдХреНрд╕ рдХреЗ рд▓рд┐рдП рджреЗрдЦреЗрдВ:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### рд▓реЙрдЧрд┐рди рд╢рд░реНрддреЛрдВ рдХреЛ рдмрд╛рдпрдкрд╛рд╕ рдХрд░рдирд╛

<figure><img src="../../.gitbook/assets/image (268).png" alt=""><figcaption></figcaption></figure>

рдЙрди рдорд╛рдорд▓реЛрдВ рдореЗрдВ рдЬрд╣рд╛рдБ рдЖрдкрдХреЗ рдкрд╛рд╕ рдХреБрдЫ рдорд╛рдиреНрдп рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рд╣реИрдВ рд▓реЗрдХрд┐рди рдЖрдк рд▓реЙрдЧрд┐рди рдирд╣реАрдВ рдХрд░ рд╕рдХрддреЗ, рдпреЗ рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп рд╕реБрд░рдХреНрд╖рд╛ рдЙрдкрд╛рдп рд╣реИрдВ рдЬреЛ рд▓рд╛рдЧреВ рд╣реЛ рд╕рдХрддреЗ рд╣реИрдВ:

* **IP рд╡реНрд╣рд╛рдЗрдЯрд▓рд┐рд╕реНрдЯрд┐рдВрдЧ** -- рдЖрдкрдХреЛ рдПрдХ рдорд╛рдиреНрдп IP рдХреЛ рд╕рдордЭреМрддрд╛ рдХрд░рдирд╛ рд╣реЛрдЧрд╛
* **рднреМрдЧреЛрд▓рд┐рдХ рдкреНрд░рддрд┐рдмрдВрдз** -- рдкрддрд╛ рдХрд░реЗрдВ рдХрд┐ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХрд╣рд╛рдБ рд░рд╣рддрд╛ рд╣реИ рдпрд╛ рдХрдВрдкрдиреА рдХреЗ рдХрд╛рд░реНрдпрд╛рд▓рдп рдХрд╣рд╛рдБ рд╣реИрдВ рдФрд░ рдЙрд╕реА рд╢рд╣рд░ (рдпрд╛ рдХрдо рд╕реЗ рдХрдо рджреЗрд╢) рд╕реЗ рдПрдХ IP рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ
* **рдмреНрд░рд╛рдЙрдЬрд╝рд░** -- рд╢рд╛рдпрдж рдХреЗрд╡рд▓ рдХреБрдЫ OS (Windows, Linux, Mac, Android, iOS) рд╕реЗ рдПрдХ рдмреНрд░рд╛рдЙрдЬрд╝рд░ рдХреА рдЕрдиреБрдорддрд┐ рд╣реИред рдкрддрд╛ рдХрд░реЗрдВ рдХрд┐ рдкреАрдбрд╝рд┐рдд/рдХрдВрдкрдиреА рдХреМрди рд╕рд╛ OS рдЙрдкрдпреЛрдЧ рдХрд░рддреА рд╣реИред
* рдЖрдк **Service Principal рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕** рдХреЛ рднреА рд╕рдордЭреМрддрд╛ рдХрд░рдиреЗ рдХреА рдХреЛрд╢рд┐рд╢ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ рдХреНрдпреЛрдВрдХрд┐ рд╡реЗ рдЖрдорддреМрд░ рдкрд░ рдХрдо рд╕реАрдорд┐рдд рд╣реЛрддреЗ рд╣реИрдВ рдФрд░ рдЙрдирдХрд╛ рд▓реЙрдЧрд┐рди рдХрдо рд╕рдореАрдХреНрд╖рд╛ рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИ

рдЗрд╕реЗ рдмрд╛рдпрдкрд╛рд╕ рдХрд░рдиреЗ рдХреЗ рдмрд╛рдж, рдЖрдк рдЕрдкрдиреА рдкреНрд░рд╛рд░рдВрднрд┐рдХ рд╕реЗрдЯрдЕрдк рдкрд░ рд╡рд╛рдкрд╕ рдЬрд╛рдиреЗ рдореЗрдВ рд╕рдХреНрд╖рдо рд╣реЛ рд╕рдХрддреЗ рд╣реИрдВ рдФрд░ рдЖрдкрдХреЗ рдкрд╛рд╕ рдЕрднреА рднреА рдкрд╣реБрдБрдЪ рд╣реЛрдЧреАред

### рдЙрдкрдбреЛрдореЗрди рдЕрдзрд┐рдЧреНрд░рд╣рдг

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
рдЬрд╛рдиреЗрдВ **рдХреИрд╕реЗ рд╕реНрдерд╛рдкрд┐рдд рдХрд░реЗрдВ** az cli, AzureAD рдФрд░ Az PowerShell [**Az - Entra ID**](az-services/az-azuread.md) рдЕрдиреБрднрд╛рдЧ рдореЗрдВред
{% endhint %}

рдЖрдкрдХреЛ рдЬрд╛рдирдиреЗ рдХреА рдЖрд╡рд╢реНрдпрдХрддрд╛ рд╣реИ рдХрд┐ рдЖрдк **рдХреМрди рд╣реИрдВ** (рдЖрдк рдХрд┐рд╕ рд╡рд╛рддрд╛рд╡рд░рдг рдореЗрдВ рд╣реИрдВ):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Azure рдХреЛ рд╕реВрдЪреАрдмрджреНрдз рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рд╕рдмрд╕реЗ рдорд╣рддреНрд╡рдкреВрд░реНрдг рдХрдорд╛рдВрдб рдореЗрдВ рд╕реЗ рдПрдХ **`Get-AzResource`** рд╣реИ рдЬреЛ Az PowerShell рд╕реЗ рд╣реИ рдХреНрдпреЛрдВрдХрд┐ рдпрд╣ рдЖрдкрдХреЛ **рдЬрд╛рдирдХрд╛рд░реА рджреЗрддрд╛ рд╣реИ рдХрд┐ рдЖрдкрдХреЗ рд╡рд░реНрддрдорд╛рди рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдкрд╛рд╕ рдХрд┐рди рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреА рджреГрд╢реНрдпрддрд╛ рд╣реИ**ред

рдЖрдк **рд╡реЗрдм рдХрдВрд╕реЛрд▓** рдореЗрдВ рднреА рдпрд╣реА рдЬрд╛рдирдХрд╛рд░реА рдкреНрд░рд╛рдкреНрдд рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) рдкрд░ рдЬрд╛рдХрд░ рдпрд╛ "рд╕рднреА рд╕рдВрд╕рд╛рдзрди" рдЦреЛрдЬрдХрд░ред
{% endhint %}

### ENtra ID Enumeration

рдбрд┐рдлрд╝реЙрд▓реНрдЯ рд░реВрдк рд╕реЗ, рдХрд┐рд╕реА рднреА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЛ **рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛рдУрдВ, рд╕рдореВрд╣реЛрдВ, рднреВрдорд┐рдХрд╛рдУрдВ, рд╕реЗрд╡рд╛ рдкреНрд░рдореБрдЦреЛрдВ** рдЖрджрд┐ рдЬреИрд╕реА рдЪреАрдЬреЛрдВ рдХреЛ рд╕реВрдЪреАрдмрджреНрдз рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП **рдкрд░реНрдпрд╛рдкреНрдд рдЕрдиреБрдорддрд┐рдпрд╛рдБ рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП**... (рдЪреЗрдХ рдХрд░реЗрдВ [рдбрд┐рдлрд╝реЙрд▓реНрдЯ AzureAD рдЕрдиреБрдорддрд┐рдпрд╛рдБ](az-basic-information/#default-user-permissions)).\
рдпрд╣рд╛рдБ рдПрдХ рдЧрд╛рдЗрдб рд╣реИ:

{% content-ref url="az-services/az-azuread.md" %}
[az-azuread.md](az-services/az-azuread.md)
{% endcontent-ref %}

{% hint style="info" %}
рдЕрдм рдЬрдм рдЖрдкрдХреЗ рдкрд╛рд╕ **рдЕрдкрдиреЗ рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА рд╣реИ** (рдФрд░ рдпрджрд┐ рдЖрдк рдПрдХ рд░реЗрдб рдЯреАрдо рд╣реИрдВ рддреЛ рдЙрдореНрдореАрдж рд╣реИ рдХрд┐ рдЖрдк **рдкрддрд╛ рдирд╣реАрдВ рдЪрд▓реЗ рд╣реИрдВ**)ред рдпрд╣ рдкрддрд╛ рд▓рдЧрд╛рдиреЗ рдХрд╛ рд╕рдордп рд╣реИ рдХрд┐ рд╡рд╛рддрд╛рд╡рд░рдг рдореЗрдВ рдХреМрди рд╕реА рд╕реЗрд╡рд╛рдПрдБ рдЙрдкрдпреЛрдЧ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВред\
рдЕрдЧрд▓реЗ рдЕрдиреБрднрд╛рдЧ рдореЗрдВ рдЖрдк **рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп рд╕реЗрд╡рд╛рдУрдВ рдХреЛ рд╕реВрдЪреАрдмрджреНрдз рдХрд░рдиреЗ рдХреЗ рдХреБрдЫ рддрд░реАрдХреЗ** рджреЗрдЦ рд╕рдХрддреЗ рд╣реИрдВред
{% endhint %}

## App Service SCM

App Service 'container' рдореЗрдВ рд▓реЙрдЧ рдЗрди рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП Kudu рдХрдВрд╕реЛрд▓ред

## Webshell

portal.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВ рдФрд░ рд╢реЗрд▓ рдХрд╛ рдЪрдпрди рдХрд░реЗрдВ, рдпрд╛ bash рдпрд╛ powershell рдХреЗ рд▓рд┐рдП shell.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВред рдЗрд╕ рд╢реЗрд▓ рдХрд╛ 'рдбрд┐рд╕реНрдХ' рдПрдХ рд╕реНрдЯреЛрд░реЗрдЬ-рдЦрд╛рддрд╛ рдореЗрдВ рдПрдХ рдЗрдореЗрдЬ рдлрд╝рд╛рдЗрд▓ рдХреЗ рд░реВрдк рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рд╣реЛрддрд╛ рд╣реИред

## Azure DevOps

Azure DevOps Azure рд╕реЗ рдЕрд▓рдЧ рд╣реИред рдЗрд╕рдореЗрдВ рд░рд┐рдкреЙрдЬрд┐рдЯрд░реА, рдкрд╛рдЗрдкрд▓рд╛рдЗрдиреНрд╕ (yaml рдпрд╛ рд░рд┐рд▓реАрдЬрд╝), рдмреЛрд░реНрдб, рд╡рд┐рдХреА, рдФрд░ рдЕрдзрд┐рдХ рд╣реИрдВред рд╡реЗрд░рд┐рдПрдмрд▓ рдЧреНрд░реБрдкреНрд╕ рдХрд╛ рдЙрдкрдпреЛрдЧ рд╡реЗрд░рд┐рдПрдмрд▓ рдорд╛рди рдФрд░ рд░рд╣рд╕реНрдпреЛрдВ рдХреЛ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред

## Debug | MitM az cli

рдкреИрд░рд╛рдореАрдЯрд░ **`--debug`** рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдпрд╣ рджреЗрдЦрдирд╛ рд╕рдВрднрд╡ рд╣реИ рдХрд┐ рдЙрдкрдХрд░рдг **`az`** рд╕рднреА рдЕрдиреБрд░реЛрдз рднреЗрдЬ рд░рд╣рд╛ рд╣реИ:
```bash
az account management-group list --output table --debug
```
рдХрд┐рд╕реА рдЯреВрд▓ рдХреЗ рд▓рд┐рдП **MitM** рдХрд░рдиреЗ рдФрд░ рдпрд╣ **рдЬрд╛рдВрдЪрдиреЗ** рдХреЗ рд▓рд┐рдП рдХрд┐ рдпрд╣ рдореИрдиреНрдпреБрдЕрд▓ рд░реВрдк рд╕реЗ рд╕рднреА рдЕрдиреБрд░реЛрдз рднреЗрдЬ рд░рд╣рд╛ рд╣реИ, рдЖрдк рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ: 

{% tabs %}
{% tab title="Bash" %}
```bash
export ADAL_PYTHON_SSL_NO_VERIFY=1
export AZURE_CLI_DISABLE_CONNECTION_VERIFICATION=1
export HTTPS_PROXY="http://127.0.0.1:8080"
export HTTP_PROXY="http://127.0.0.1:8080"

# If this is not enough
# Download the certificate from Burp and convert it into .pem format
# And export the following env variable
openssl x509 -in ~/Downloads/cacert.der -inform DER -out ~/Downloads/cacert.pem -outform PEM
export REQUESTS_CA_BUNDLE=/Users/user/Downloads/cacert.pem
```
{% endtab %}

{% tab title="PS" %}
```bash
$env:ADAL_PYTHON_SSL_NO_VERIFY=1
$env:AZURE_CLI_DISABLE_CONNECTION_VERIFICATION=1
$env:HTTPS_PROXY="http://127.0.0.1:8080"
$env:HTTP_PROXY="http://127.0.0.1:8080"
```
{% endtab %}
{% endtabs %}

## рд╕реНрд╡рдЪрд╛рд▓рд┐рдд рдкреБрдирдГ рдЦреЛрдЬ рдЙрдкрдХрд░рдг

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeEntraID -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the тАШContributorтАЩ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
### [**GraphRunner**](https://github.com/dafthack/GraphRunner/wiki/Invoke%E2%80%90GraphRunner)
```powershell

#Get-GraphTokens
#A good place to start is to authenticate with the Get-GraphTokens module. This module will launch a device-code login, allowing you to authenticate the session from a browser session. Access and refresh tokens will be written to the global $tokens variable. To use them with other GraphRunner modules use the Tokens flag (Example. Invoke-DumpApps -Tokens $tokens)
Import-Module .\GraphRunner.ps1
Get-GraphTokens

#Invoke-GraphRecon
#This module gathers information about the tenant including the primary contact info, directory sync settings, and user settings such as if users have the ability to create apps, create groups, or consent to apps.
Invoke-GraphRecon -Tokens $tokens -PermissionEnum

#Invoke-DumpCAPS
#A module to dump conditional access policies from a tenant.
Invoke-GraphRecon -Tokens $tokens -PermissionEnum

#Invoke-DumpCAPS
#A module to dump conditional access policies from a tenant.
Invoke-DumpCAPS -Tokens $tokens -ResolveGuids

#Invoke-DumpApps
#This module helps identify malicious app registrations. It will dump a list of Azure app registrations from the tenant including permission scopes and users that have consented to the apps. Additionally, it will list external apps that are not owned by the current tenant or by Microsoft's main app tenant. This is a good way to find third-party external apps that users may have consented to.
Invoke-DumpApps -Tokens $tokens

#Get-AzureADUsers
#Gather the full list of users from the directory.
Get-AzureADUsers -Tokens $tokens -OutFile users.txt

#Get-SecurityGroups
#Create a list of security groups along with their members.
Get-SecurityGroups -AccessToken $tokens.access_token

G#et-UpdatableGroups
#Gets groups that may be able to be modified by the current user
Get-UpdatableGroups -Tokens $tokens

#Get-DynamicGroups
#Finds dynamic groups and displays membership rules
Get-DynamicGroups -Tokens $tokens

#Get-SharePointSiteURLs
#Gets a list of SharePoint site URLs visible to the current user
Get-SharePointSiteURLs -Tokens $tokens

#Invoke-GraphOpenInboxFinder
#This module attempts to locate mailboxes in a tenant that have allowed other users to read them. By providing a userlist the module will attempt to access the inbox of each user and display if it was successful. The access token needs to be scoped to Mail.Read.Shared or Mail.ReadWrite.Shared for this to work.
Invoke-GraphOpenInboxFinder -Tokens $tokens -Userlist users.txt

#Get-TenantID
#This module attempts to gather a tenant ID associated with a domain.
Get-TenantID -Domain

#Invoke-GraphRunner
#Runs Invoke-GraphRecon, Get-AzureADUsers, Get-SecurityGroups, Invoke-DumpCAPS, Invoke-DumpApps, and then uses the default_detectors.json file to search with Invoke-SearchMailbox, Invoke-SearchSharePointAndOneDrive, and Invoke-SearchTeams.
Invoke-GraphRunner -Tokens $tokens
```
{% hint style="success" %}
рд╕реАрдЦреЗрдВ рдФрд░ AWS рд╣реИрдХрд┐рдВрдЧ рдХрд╛ рдЕрднреНрдпрд╛рд╕ рдХрд░реЗрдВ:<img src="../../.gitbook/assets/image (1) (1) (1) (1).png" alt="" data-size="line">[**HackTricks Training AWS Red Team Expert (ARTE)**](https://training.hacktricks.xyz/courses/arte)<img src="../../.gitbook/assets/image (1) (1) (1) (1).png" alt="" data-size="line">\
рд╕реАрдЦреЗрдВ рдФрд░ GCP рд╣реИрдХрд┐рдВрдЧ рдХрд╛ рдЕрднреНрдпрд╛рд╕ рдХрд░реЗрдВ: <img src="../../.gitbook/assets/image (2) (1).png" alt="" data-size="line">[**HackTricks Training GCP Red Team Expert (GRTE)**<img src="../../.gitbook/assets/image (2) (1).png" alt="" data-size="line">](https://training.hacktricks.xyz/courses/grte)

<details>

<summary>HackTricks рдХрд╛ рд╕рдорд░реНрдерди рдХрд░реЗрдВ</summary>

* [**рд╕рджрд╕реНрдпрддрд╛ рдпреЛрдЬрдирд╛рдПрдБ**](https://github.com/sponsors/carlospolop) рджреЗрдЦреЗрдВ!
* **рд╣рдорд╛рд░реЗ** ЁЯТм [**Discord рд╕рдореВрд╣**](https://discord.gg/hRep4RUj7f) рдпрд╛ [**telegram рд╕рдореВрд╣**](https://t.me/peass) рдореЗрдВ рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ рдпрд╛ **рд╣рдореЗрдВ** **Twitter** ЁЯРж [**@hacktricks\_live**](https://twitter.com/hacktricks_live)** рдкрд░ рдлреЙрд▓реЛ рдХрд░реЗрдВред**
* **рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ рдФрд░** [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) рдЧрд┐рдЯрд╣рдм рд░рд┐рдкреЛрдЬрд┐рдЯрд░реА рдореЗрдВ PR рд╕рдмрдорд┐рдЯ рдХрд░реЗрдВред

</details>
{% endhint %}
